Exercise: Build decision tree model to predict survival based on certain parameters
In this file using following columns build a model to predict if person would survive or not,
1.Pclass
2.Sex
3.Age
4.Fare
Calculate score of your model

In [1]:
import pandas as pd
df=pd.read_csv("titanic.csv")

In [5]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [11]:
df=df[['Survived','Pclass','Sex','Age','Fare']]
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [12]:
input=df.drop('Survived',axis="columns")

In [13]:
target=df['Survived']
input

     Pclass     Sex   Age     Fare
0         3    male  22.0   7.2500
1         1  female  38.0  71.2833
2         3  female  26.0   7.9250
3         1  female  35.0  53.1000
4         3    male  35.0   8.0500
..      ...     ...   ...      ...
886       2    male  27.0  13.0000
887       1  female  19.0  30.0000
888       3  female   NaN  23.4500
889       1    male  26.0  30.0000
890       3    male  32.0   7.7500

[891 rows x 4 columns]

In [14]:
input=input.interpolate()

In [15]:
input.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [19]:
input.Age=input.Age.astype(int)

In [20]:
input.Age[5]

44

In [32]:
from sklearn.preprocessing import LabelEncoder
le_Sex=LabelEncoder()
input['sex_n']=le_Sex.fit_transform(input['Sex'])

In [33]:
input.sex_n.head()

0    1
1    0
2    0
3    0
4    1
Name: sex_n, dtype: int32

In [37]:
inputs_n = input.drop(['Sex','age_n'],axis='columns')

In [38]:
inputs_n

     Pclass  Age     Fare  sex_n
0         3   22   7.2500      1
1         1   38  71.2833      0
2         3   26   7.9250      0
3         1   35  53.1000      0
4         3   35   8.0500      1
..      ...  ...      ...    ...
886       2   27  13.0000      1
887       1   19  30.0000      0
888       3   22  23.4500      0
889       1   26  30.0000      1
890       3   32   7.7500      1

[891 rows x 4 columns]

In [39]:
from sklearn import tree
model=tree.DecisionTreeClassifier()

In [40]:
model.fit(inputs_n,target)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=None, splitter='best')

In [41]:
model.score(inputs_n,target)

0.9820426487093153